liefyuan/stm32-spi-st7789-240x240tft/Project/HARDWARE/st7789-spi1/lcd_driver.c
#include "lcd_driver.h"

#include "stm32f4xx.h"
#include "stm32f4xx_spi.h"
#include "delay.h"

#include "st7789_gpio_spi.h"
#include "st7789_hal_spi1.h"

#if USE_DMA_SPI1
#include "hal_spi1_dma.h"
#endif // USE_DMA_SPI

#define USE_HAL_SPI  1


void LCD_Init(void)
{
#if USE_HAL_SPI
	hal_spi1_gpio_init();
		
	hal_spi1_hard_reset();
	
	hal_spi1_lcd_init();
#else
	gpio_spi_init();
	
	gpio_spi_hard_reset();
	
	gpio_spi_lcd_init();
#endif
}

//向液晶屏写一个8位指令
void Lcd_WriteIndex(uint8_t Index)
{
#if USE_HAL_SPI
	hal_spi1_write_cmd(Index);
#else
	gpio_spi_write_cmd(Index);
#endif
}

//向液晶屏写一个8位数据
void Lcd_WriteData(uint8_t Data)
{
#if USE_HAL_SPI
	hal_spi1_write_8bit_data(Data);
#else
	gpio_spi_write_8bit_data(Data);
#endif
}
//向液晶屏写一个16位数据
void LCD_WriteData_16Bit(uint16_t Data)
{
#if USE_HAL_SPI
	hal_spi1_write_16bit_data(Data);
#else
	gpio_spi_write_16bit_data(Data);
#endif
}

void Lcd_Reset(void)
{
#if USE_HAL_SPI
	hal_spi1_hard_reset();
#else
	gpio_spi_hard_reset();
#endif
}

/***********************************************************************/

void Lcd_Full(uint16_t color)
{
#if USE_HAL_SPI
	#if USE_DMA_SPI1
		dma_hal_spi1_clear(color);
	#else
		hal_spi1_clear(color);
	#endif
#else
	gpio_spi_clear(color);
#endif
}

void Lcd_Test(void)
{

}


